<template>
  <v-layout row wrap pa-3>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2 text-xs-center>
      <h1>Бесплатный челлендж «БУДЬ В ФОРМЕ»</h1>
      <p>
        Продолжительность челленджа: 2 недели (10 тренировок, 4 выходных)
      </p>
      <br>
    </v-flex>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2 class="text-justify">
      <p>
        Друзья, всем привет! Добро пожаловать на мой бесплатный челлендж «БУДЬ В ФОМЕ»! Этот челлендж – отличная возможность начать тренироваться регулярно и в кайф!
      </p>
      <p>
        Тренировочный план составлен таким образом, что физические нагрузки будут приносить вам удовольствие, хорошее настроение и заряд бодрости. Для тренировок не требуется никакого оборудования, только небольшое пространство, коврик и интернет.
      </p>
      <p>
        Каждый день вы будете тратить на тренировку около 30 мин. Это будет короткая, но качественная работа, которая даст результат.
      </p>
      <h3>Мои рекомендации по выполнению тренировок:</h3>
      <ul>
        <li>
          Советую делать тренировки утром, вставать чуть раньше обычного и успевать потренироваться до начала рабочего дня. С утра организм полон энергии, а после тренировки появится дополнительный заряд эмоций и сил.
        </li>
        <li>
          Обязательно делайте хорошую разминку перед каждой тренировкой, это исключит вероятность травмы. Когда наше тело хорошо подготовлено к нагрузке, тренировка будет на все 100% эффективна.
        </li>
        <li>
          Во время тренировки будьте сконцентрированы и собраны, выполняйте каждое упражнение внимательно и вдумчиво. Это поможет мышцам работать эффективнее, и соответственно, повысит результат.
        </li>
        <li>
          После тренировки обязательно уделяйте 5-10 мин растяжке. Можете делать мой комплекс или растягиваться самостоятельно. При выполнении растяжки мышцы восстанавливаются быстрее, приобретают эластичность и не забиваются. Растяжку необходимо выполнять после каждой тренировки и ваше тело скажет вам спасибо!
        </li>
      </ul>

      <p class="mt-5">
        <strong>В рамках челленджа «БУДЬ В ФОРМЕ» я проведу конкурс!</strong> Самый активный участник челленджа получит бесплатный доступ к моей новой программе тренировок с элементами FLOW. Старт программы 1 октября!
      </p>
      <h3>Что нужно сделать, чтобы стать самым активным участником челленджа:</h3>
      <ul>
        <li>
          Сделать все тренировки из программы челленджа
        </li>
        <li>
          После каждой тренировки выложить мини видео-отчет в сторис инстаграм (количество сторис не имеет значение) и отметить мой аккаунт <strong>@evgenia_kabanova</strong> и поставить хештег <strong>#beinshapechallenge</strong>
        </li>
        <li>
          Тот участник, у которого будут самые интересные видео-отчеты, станет победителем конкурса. Победителя я буду выбирать лично и назову его имя в день окончания челленджа, т.е. 28 сентября 2019г.
        </li>
      </ul>

      <h2 class="text-xs-center mt-5">Челлендж «БУДЬ В ФОРМЕ»</h2>
      <p class="text-xs-center"><strong>План тренировок</strong></p>
    </v-flex>
    <v-flex xs12 sm12 md6 pa-3>
      <v-card>
        <v-card-title>
          <h3>Неделя 1</h3>
        </v-card-title>
        <v-card-text>
          <v-data-table
            :items="week1"
            class="elevation-1"
            hide-actions
            hide-headers
          >
            <template v-slot:items="props">
              <td style="font-weight: 900">{{ props.item.day }}</td>
              <td>{{ props.item.text }}</td>
            </template>
          </v-data-table>
        </v-card-text>
      </v-card>
    </v-flex>
    <v-flex xs12 sm12 md6 pa-3>
      <v-card>
        <v-card-title>
          <h3>Неделя 2</h3>
        </v-card-title>
        <v-card-text>
          <v-data-table
            :items="week2"
            class="elevation-1"
            hide-actions
            hide-headers
          >
            <template v-slot:items="props">
              <td style="font-weight: 900">{{ props.item.day }}</td>
              <td>{{ props.item.text }}</td>
            </template>
          </v-data-table>
        </v-card-text>
      </v-card>
    </v-flex>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2 >
      <p>
        Чтобы начать тренировку, нужно перейти по ссылке на видео.
      </p>
      <p>
        Рекомендую придерживаться именно такого плана тренировок на время проведения челленджа.
      </p>
    </v-flex>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2 v-if="product !== null && product !== undefined && product !== 'undefined'">
      <v-layout row wrap>
        <v-flex xs12>
          <v-expansion-panel expand>
            <v-expansion-panel-content
              v-for="(day,i) in product.days"
              :key="i"
            >
              <template v-slot:header>
                <div>{{day.title}}</div>
              </template>
              <v-card class="grey lighten-4">
                <v-card-text>
                  <iframe width="100%" height="315" :src="'https://www.youtube.com/embed/'+ day.youtube_id" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                </v-card-text>
              </v-card>
            </v-expansion-panel-content>
          </v-expansion-panel>
        </v-flex>
      </v-layout>
    </v-flex>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2 >
      <h3 class="mt-5">Рекомендации по питанию:</h3>
      <p>
        Это не секрет, что тренировки – это форма и качество тела и лишь 20% успеха, а питание – это объемы тела и 80% успеха. Поэтому, если у вас есть цель похудеть, то вам необходимо будет в комплексе с тренировками следить за своим питанием. Тут самое главное это баланс калорий:
      </p>
      <ul>
        <li>Потребляете столько же, сколько тратите: ничего не меняется</li>
        <li>Потребляете больше, чем тратите: набираете вес</li>
        <li>Потребляете меньше, чем тратите: худеете (правильный дефицит калорий)</li>
      </ul>

      <p>
        Согласно стандартам Всемирной Организации Здравоохранения, человеку требуется следующая суточная норма БЖУ (белки, жиры, углеводы):
      </p>
      <ul>
        <li>Углеводы 50%</li>
        <li>Белки 30%</li>
        <li>Жиры 20%</li>
      </ul>

      <p>
        Похудеть без вреда для организма можно только за счет правильного дефицита калорий, но не в коем случае, не за счет голодания. Голодание может применяться в медицинских целях исключительно для лечения определенных заболеваний.
      </p>
      <p>
        Стандартная величина основного обмена (сколько вы тратите калорий в сутки): 1300-1500 калорий. У того, кто активно тренируется: 1800-2000 калорий.
      </p>
      <p>
        Очень важно ориентироваться в калорийности продуктов и знать сколько калорий в день вы потребляете. Полезно вести пищевой дневник, где вы фиксируете все, что вы съели и сколько это «стоит» (сколько калорий), тогда вы будете точны в расчетах и будете знать, как вам скорректировать ваш план питания.
      </p>
      <p>
        В питании очень важную роль играет дисциплина. Дисциплина – это свобода. Только по-настоящему дисциплинированный человек является свободным от своих желаний. Есть очень классное выражение: «Дисциплина – это выбор между тем, что ты хочешь сейчас и тем, что ты хочешь больше всего». Человек свободен, если он выбрал свой курс.
      </p>
      <p>
        Выбери свой курс и иди к цели! БУДЬ В ФОРМЕ!
      </p>
    </v-flex>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2>
      <v-img class="img-bordered elevation-16 mt-3 mb-5" :src="require('../../../static/img/program2_1.jpg')" style="border: 30px solid white;"></v-img>
    </v-flex>
  </v-layout>
</template>

<script>
export default {
  props: ['product'],
  async created () {
    console.log(this.product)
  },
  data () {
    return {
      week1: [
        {
          day: 'День 1',
          text: 'Разминка 1. Тренировка 1 Комплекс. Растяжка'
        },
        {
          day: 'День 2',
          text: 'Разминка 1. Тренировка 2 Кардио. Растяжка'
        },
        {
          day: 'День 3',
          text: 'Выходной'
        },
        {
          day: 'День 4',
          text: 'Разминка 1. Тренировка 3 Лесенка. Растяжка'
        },
        {
          day: 'День 5',
          text: 'Разминка 1. Тренировка 4 Мобильность. Растяжка'
        },
        {
          day: 'День 6',
          text: 'Разминка 1. Тренировка 5 Комплекс. Растяжка'
        },
        {
          day: 'День 7',
          text: 'Выходной'
        }
      ],
      week2: [
        {
          day: 'День 8',
          text: 'Разминка 2. Тренировка 6 Комплекс. Растяжка'
        },
        {
          day: 'День 9',
          text: 'Разминка 2. Тренировка 7 Мобильность. Растяжка'
        },
        {
          day: 'День 10',
          text: 'Выходной'
        },
        {
          day: 'День 11',
          text: 'Разминка 2. Тренировка 8 Комплекс. Растяжка'
        },
        {
          day: 'День 12',
          text: 'Разминка 2. Тренировка 9 Баланс. Растяжка'
        },
        {
          day: 'День 13',
          text: 'Разминка 2. Тренировка 10 Лесенка. Растяжка'
        },
        {
          day: 'День 14',
          text: 'Выходной – день завершения челледжа'
        }
      ]
    }
  }

}
</script>

<style>

</style>
