<template>
  <v-layout row wrap>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2 lg6 offset-lg3 text-xs-center>
      <h1>Бесплатный челлендж «БУДЬ В ФОРМЕ» (2 недели)</h1>
      <p>
        Старт 15 сентября 2019
      </p>
      <p>
        (доступ открыт до 18 сентября)
      </p>
      <br>
      <h3>Регистрация</h3>
    </v-flex>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2 lg6 offset-lg3 class="text-justify">
      <p>
        Друзья, всем привет! Добро пожаловать на мой бесплатный челлендж «БУДЬ В ФОМЕ»! Этот челлендж – отличная возможность начать тренироваться регулярно и в кайф!
      </p>
      <p>
        Тренировочный план составлен таким образом, что физические нагрузки будут приносить вам удовольствие, хорошее настроение и заряд бодрости. Для тренировок не требуется никакого оборудования, только небольшое пространство, коврик и интернет.
      </p>
      <p>
        Каждый день вы будете тратить на тренировку около 30 мин. Это будет короткая, но качественная работа, которая даст результат.
      </p>
      <h3>Мои рекомендации по выполнению тренировок:</h3>
      <ul>
        <li>
          Советую делать тренировки утром, вставать чуть раньше обычного и успевать потренироваться до начала рабочего дня. С утра организм полон энергии, а после тренировки появится дополнительный заряд эмоций и сил.
        </li>
        <li>
          Обязательно делайте хорошую разминку перед каждой тренировкой, это исключит вероятность травмы. Когда наше тело хорошо подготовлено к нагрузке, тренировка будет на все 100% эффективна.
        </li>
        <li>
          Во время тренировки будьте сконцентрированы и собраны, выполняйте каждое упражнение внимательно и вдумчиво. Это поможет мышцам работать эффективнее, и соответственно, повысит результат.
        </li>
        <li>
          После тренировки обязательно уделяйте 5-10 мин растяжке. Можете делать мой комплекс или растягиваться самостоятельно. При выполнении растяжки мышцы восстанавливаются быстрее, приобретают эластичность и не забиваются. Растяжку необходимо выполнять после каждой тренировки и ваше тело скажет вам спасибо!
        </li>
      </ul>

      <p class="mt-5">
        <strong>В рамках челленджа «БУДЬ В ФОРМЕ» я проведу конкурс!</strong> Самый активный участник челленджа получит бесплатный доступ к моей новой программе тренировок с элементами FLOW. Старт программы 1 октября!
      </p>
      <h3>Что нужно сделать, чтобы стать самым активным участником челленджа:</h3>
      <ul>
        <li>
          Сделать все тренировки из программы челленджа
        </li>
        <li>
          После каждой тренировки выложить мини видео-отчет в сторис инстаграм (количество сторис не имеет значение) и отметить мой аккаунт <strong>@evgenia_kabanova</strong> и поставить хештег <strong>#beinshapechallenge</strong>
        </li>
        <li>
          Тот участник, у которого будут самые интересные видео-отчеты, станет победителем конкурса. Победителя я буду выбирать лично и назову его имя в день окончания челленджа
        </li>
      </ul>

      <h2 class="text-xs-center mt-5">Челлендж «БУДЬ В ФОРМЕ»</h2>
      <p class="text-xs-center"><strong>План тренировок</strong></p>
    </v-flex>
    <v-flex xs12 md6 pa-5>
      <v-card>
        <v-card-title>
          <h3>Неделя 1</h3>
        </v-card-title>
        <v-card-text>
          <v-data-table
            :items="week1"
            class="elevation-1"
            hide-actions
            hide-headers
          >
            <template v-slot:items="props">
              <td style="font-weight: 900">{{ props.item.day }}</td>
              <td>{{ props.item.text }}</td>
            </template>
          </v-data-table>
        </v-card-text>
      </v-card>
    </v-flex>
    <v-flex xs12 md6 pa-5>
      <v-card>
        <v-card-title>
          <h3>Неделя 2</h3>
        </v-card-title>
        <v-card-text>
          <v-data-table
            :items="week2"
            class="elevation-1"
            hide-actions
            hide-headers
          >
            <template v-slot:items="props">
              <td style="font-weight: 900">{{ props.item.day }}</td>
              <td>{{ props.item.text }}</td>
            </template>
          </v-data-table>
        </v-card-text>
      </v-card>
    </v-flex>
    <v-flex xs12 sm10 offset-sm1 md8 offset-md2 lg6 offset-lg3>
      <p>
        Чтобы начать тренировку, нужно перейти по ссылке на видео.
      </p>
      <p>
        Рекомендую придерживаться именно такого плана тренировок на время проведения челленджа.
      </p>
    </v-flex>
  </v-layout>
</template>

<script>
export default {
  data () {
    return {
      week1: [
        {
          day: 'День 1',
          text: 'Разминка 1. Тренировка 1 Комплекс. Растяжка'
        },
        {
          day: 'День 2',
          text: 'Разминка 1. Тренировка 2 Кардио. Растяжка'
        },
        {
          day: 'День 3',
          text: 'Выходной'
        },
        {
          day: 'День 4',
          text: 'Разминка 1. Тренировка 3 Лесенка. Растяжка'
        },
        {
          day: 'День 5',
          text: 'Разминка 1. Тренировка 4 Мобильность. Растяжка'
        },
        {
          day: 'День 6',
          text: 'Разминка 1. Тренировка 5 Комплекс. Растяжка'
        },
        {
          day: 'День 7',
          text: 'Выходной'
        }
      ],
      week2: [
        {
          day: 'День 8',
          text: 'Разминка 2. Тренировка 6 Комплекс. Растяжка'
        },
        {
          day: 'День 9',
          text: 'Разминка 2. Тренировка 7 Мобильность. Растяжка'
        },
        {
          day: 'День 10',
          text: 'Выходной'
        },
        {
          day: 'День 11',
          text: 'Разминка 2. Тренировка 8 Комплекс. Растяжка'
        },
        {
          day: 'День 12',
          text: 'Разминка 2. Тренировка 9 Баланс. Растяжка'
        },
        {
          day: 'День 13',
          text: 'Разминка 2. Тренировка 10 Лесенка. Растяжка'
        },
        {
          day: 'День 14',
          text: 'Выходной – день завершения челледжа'
        }
      ]
    }
  }

}
</script>

<style>

</style>
